/*Задача 2: Implicit Перетворення (комплексні числа, це схоже 
 * до реальних чисел але в них є два компоненти - звичайна частина і уявна частина)
Створіть клас ComplexNumber, що містить два числа: реальну 
та уявну частини. Додайте неявне перетворення з ComplexNumber до типу string,
де значення буде виведено як реальна частина + уявна частина i.*/
namespace _10._12._2024___implicit_2
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}
