//1.Створити 6 дат народження. Знайти середнє, визначити хто молодший за середнє. 
//2. Є набір чисел {1,5,7,9,12, 15,18, 25}. Із цього масиву створити новий масив
//чисел де будуть тільки ті числа які діляться націло на п'ять.
//3. Згенерувати рандомний набір на 20 елементів від 1 до 100. 
//Знайти середнє арифметичне. І виписати в окремий масив всі числа і більші за середнє арифметичне і парні.
class Human
{
    public DateTime birthday;
}
Human[] humans = new Human[3];

humans[0] = new Human();
humans[1] = new Human();
humans[2] = new Human();

humans[0].birthday = new DateTime(1996, 4, 17);
humans[1].birthday = new DateTime(1990, 11, 17);
humans[2].birthday = new DateTime(1992, 5, 16);
