//11.Метод який приймає в себе строку і число. А повертає строку обрізану за числом.
//Наприклад строка "Hello Moto" а число 3, на виході буде "Hel"


//12. Розширений варіант 11 завадння. Метод приймає в себе строку, число і ще одне число.
//Повертає строку від першого числа до 2 числа. Наприклад "SomeText" і числа 2, 5 то на виході буде "meT"


//13. Метод який генерує суму двох рандомних чисел кубиків (від 1 до 6).


//14.Метод який використовує метод 13) 2 рази.Цей метод нічого не приймає.
//Він емулює кидки пар кубиків двох гравців. І потім повертає текс в залежності в кого більше очок.
//Якщо в першого очок більше то "виграв перший", якщо однаково то "нічия" і якщо більше в другого то "виграв другий".


//15. Метод який використовує 14) метод кілька разів. На вхід метод приймає кількість ігор.
//Далі викликається стільки разів 14 метод. І на вихід подається число % від виграша першого гравця.
//Наприклад якщо було ігор 10, перший гравець виграв 6 разів, 1 нічия і другий гравець виграв 3 рази,
//то повернеться 60% (double). 60 % вернеться тому що гравець виграв 6 разів із 10 ігор. 6/10 * 100%


//11
static string SubString(string first, int toCut)
{
    string sub = first.Substring(0, 3);
    Console.WriteLine(sub);
    return sub;

};
SubString("Hello Moto", 3);
